#+TITLE: Mail Configuration
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:emacs-lisp :tangle .guix.emacs.d/lisp/dw-mail.el

** gpg agent

~pinentry~ is the application that is responsible to ask you for the gpg passphrase. pinentry have applications for many environments. Such as curses, emacs, gnome, gtk, qt and tty. 

If  using pinentry-emacs. This requires some setup in order for Emacs to handle pinentry requests.

#+begin_src shell
echo "default-cache-ttl 3600
allow-loopback-pinentry
pinentry-program /usr/bin/pinentry-gtk-2
allow-emacs-pinentry" | tee ~/.gnupg/gpg-agent.conf
#+end_src

#+RESULTS:
| default-cache-ttl       |                    3600 |
| allow-loopback-pinentry |                         |
| pinentry-program        | /usr/bin/pinentry-emacs |
| allow-emacs-pinentry    |                         |

*** Check isync version

#+begin_src shell
mbsync --version
#+end_src

#+RESULTS:
: isync 1.3.0

